# Related Tables

In [1]:
import pandas as pd

### Related Table

In [5]:
filepath = '../DataSets/athletes/'
data_main = pd.read_csv(filepath+'Medals.csv',encoding='ISO-8859-1')

In [6]:
data_main.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6

In [7]:
a = data_main["Athlete"].unique().tolist()

In [8]:
len(a)

6956

### Athlete_Country Table

In [9]:
data_country=pd.read_csv(filepath+"Athelete_Country_Map.csv", encoding='ISO-8859-1')

In [10]:
data_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

### Soprts_Athlete Table

In [11]:
data_sports=pd.read_csv(filepath+"Athelete_Sports_Map.csv", encoding='ISO-8859-1')

In [14]:
data_sports.head()

            Athlete       Sport
0    Michael Phelps    Swimming
1  Natalie Coughlin    Swimming
2     Aleksey Nemov  Gymnastics
3     Alicia Coutts    Swimming
4    Missy Franklin    Swimming

### Tables Mergs

In [18]:
data_country_without_dp = data_country.drop_duplicates(subset="Athlete")

In [19]:
data_Main_Country = pd.merge(left=data_main, right=data_country_without_dp, left_on="Athlete",right_on="Athlete")

In [20]:
data_Main_Country.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States

In [22]:
data_Main_Country.shape

(8618, 9)

In [24]:
data_Main_Country[data_Main_Country["Athlete"]=="Aleksandar Ciric"]

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
1491,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia
1492,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia
1493,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia